ЕРПУХАстенд.cbr_Основной/src/Catalogs/СоглашенияСКлиентами/СоглашенияСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2bb5c12e-1217-4c8d-ae01-3a6253cfe429">
  <name>СоглашенияСКлиентами</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>cbr_ЦеныПоТоварам</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрцентРучнаяСкидка</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнаяСкидка</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикиИспользуются</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/СоглашенияСКлиентами/Forms/ФормаЭлемента/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЦеныПоТоварамНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ЦеныПоТоварам.ТекущиеДанные;
	
	ХарактеристикиИспользуются = ПроверитьИспользованиеХарактеристик(ТекущаяСтрока.Номенклатура);

	Если ХарактеристикиИспользуются Тогда
		ТекущаяСтрока.ХарактеристикиИспользуются = ХарактеристикиИспользуются;
	КонецЕсли;
	
	ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
	
	ЦеныПоТоварамНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамКоличествоПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамПрцентРучнаяСкидкаПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамСуммаРучнаяСкидкаПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамЦенаСоСкидкойПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныПоТоварамСуммаПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Процедура ЦеныПоТоварамНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки)
 	ТекущаяСтрокаТЧ = Объект.cbr_ЦеныПоТоварам.НайтиПоИдентификатору(ИдентификаторСтроки);
 	ТекущаяСтрокаТЧ.ВидЦены = Объект.ВидЦен;
 	ТекущаяСтрокаТЧ.Цена = ПолучитьЦенуНоменклатуры(ТекущаяСтрокаТЧ.Номенклатура, ТекущаяСтрокаТЧ.ВидЦены);
 	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ВидЦены)
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатуры25СрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(&Дата, Номенклатура = &Номенклатура
		|	И ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры25СрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить()[0].Цена;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПроверитьИспользованиеХарактеристик(Номенклатура)
	ХарактеристикиИспользуются = Справочники.Номенклатура.ПроверитьИспользованиеХарактеристикИПолучитьВладельцаДляВыбора(Номенклатура, );
	
	Возврат ХарактеристикиИспользуются;
КонецФункции

&После("УстановитьУсловноеОформление")
&НаСервере
Процедура cbr_УстановитьУсловноеОформление()
	ДополнитьУсловноеОформлениеЦеныПоТоварам();
КонецПроцедуры

&НаСервере
Процедура ДополнитьУсловноеОформлениеЦеныПоТоварам() 
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристикиИспользуются");
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость",  Ложь);
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЦеныПоТоварамХарактеристика");
	
    ОтборЭлемента                = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.cbr_ЦеныПоТоварам.ХарактеристикиИспользуются");
    ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ОтборЭлемента.ПравоеЗначение = Ложь; 
    
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность",  Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Не используются>");
КонецПроцедуры

#КонецОбласти
